import os
import sys

# 主名=".".join(源文件名.split(".")[:-1])
# 源文件名=".".join([主名,"c"])
# 预处理文件名=".".join([主名,"i"])
# 汇编语言文件名=".".join([主名,"s"])
# 机器码文件名=".".join([主名,"o"])
# 可执行文件名=".".join([主名,"exe"])

def cls():
	os.system("cls")
def pause():
	os.system("pause")
def 退出反馈(错误信息):
	print(错误信息)
	pause()
	exit()

def 生成命令(主名,拓展名):
	参与的文件=["c","i","s","o","exe"]
	被用的文件=参与的文件[:-1]
	被生成的文件=参与的文件[1:]
	所有可能的起始点={
		"c" : 0,
		"i" : 1,
		"s" : 2,
		"o"	: 3
		}
	指令辅助=[
		["预处理",	"-E",	".".join([主名,被用的文件[0]]),	".".join([主名,被生成的文件[0]])],
		["编译",		"-S",	".".join([主名,被用的文件[1]]),	".".join([主名,被生成的文件[1]])],
		["汇编",		"-c",	".".join([主名,被用的文件[2]]),	".".join([主名,被生成的文件[2]])],
		["连接", 	"" ,	".".join([主名,被用的文件[3]]),	".".join([主名,被生成的文件[3]])]
		]
	def 生成一条命令(行为):
		print("现在生成\t“{}”\t命令，它利用\t“{}”\t生成\t“{}”".format(行为[0],行为[2],行为[3]))
		return "gcc {} {} -o {} -finput-charset=UTF-8 -fexec-charset=GBK -lpthread".format(行为[1],行为[2],行为[3])
	try:
		起始点=所有可能的起始点[拓展名]
	except:
		退出反馈("你这拓展名太假了")
	需要执行的命令=[]
	for 行为 in 指令辅助[起始点:]:
		需要执行的命令+=[生成一条命令(行为)]
	return 需要执行的命令

def main():
	主名,拓展名="多线程练习","c"
	所有命令=生成命令(主名,拓展名)
	for 命令 in 所有命令:
		os.system(命令)
	print("编译完成")
	pause()

if (__name__=="__main__"):
	main()
